Feature: File Complaint
    Feature Login page will work depending on the user credentials.

  Background:
    Given เปิดเว็บไซต์ PMRP

  @smoke @sanity
  Scenario: TC001-การเข้าถึงหน้าเพิ่มประเภทคำร้องเรียน (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And คลิกปุ่มเพิ่มประเภทคำร้องเรียน
    Then ระบบแสดงหน้าเมนูเพิ่มประเภทคำร้องเรียน

  Scenario: TC002-การเพิ่มประเภทคำร้องเรียนสำเร็จ (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And คลิกปุ่มเพิ่มประเภทคำร้องเรียน
    And กรอกชื่อประเภทคำร้อง "การร้องเรียนด้านบริการ"
    And กรอกรายละเอียดประเภทคำร้อง "ปัญหาที่เกี่ยวข้องกับการให้บริการ"
    And เปิดใช้งานการมองเห็น
    Then คลิกปุ่มบันทึก

  Scenario: TC003-การยกเลิกการเพิ่มประเภทคำร้องเรียน (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And คลิกปุ่มเพิ่มประเภทคำร้องเรียน
    Then คลิกปุ่มยกเลิก

  Scenario: TC004-การเพิ่มประเภทคำร้องเรียนที่มีช่องว่างด้านหน้า-ด้านหลัง (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And คลิกปุ่มเพิ่มประเภทคำร้องเรียน
    And กรอกชื่อประเภทคำร้อง "  การร้องเรียนด้านบริการ"
    Then คลิกปุ่มบันทึก

  Scenario: TC005-การเพิ่มประเภทคำร้องเรียนที่รองรับหลายภาษา (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And คลิกปุ่มเพิ่มประเภทคำร้องเรียน
    And กรอกชื่อประเภทคำร้อง "Customer Service Issue"
    Then คลิกปุ่มบันทึก

  Scenario: TC008-การเพิ่มประเภทคำร้องเรียนที่ซ้ำกัน (Negative)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And คลิกปุ่มเพิ่มประเภทคำร้องเรียน
    And กรอกชื่อประเภทคำร้อง "การร้องเรียนด้านบริการ"
    And กรอกรายละเอียดประเภทคำร้อง "ปัญหาที่เกี่ยวข้องกับการให้บริการ"
    Then คลิกปุ่มบันทึก

  Scenario: TC008-การเพิ่มประเภทคำร้องเรียนที่ซ้ำกัน (Negative)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And คลิกปุ่มเพิ่มประเภทคำร้องเรียน
    And กรอกชื่อประเภทคำร้อง "!!!บริการ@#!"
    Then คลิกปุ่มบันทึก