Feature: File Complaint
    Feature Login page will work depending on the user credentials.

  Background:
    Given เปิดเว็บไซต์ PMRP

  @smoke @sanity
  Scenario: TC001-ค้นหาคำร้องเรียนด้วยหมายเลขคำร้อง (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประวัติคำร้องเรียน
    And กรอกหมายเลขคำร้องเรียน "TTT68030078"
    And คลิกปุ่มค้นหา
    Then ระบบแสดงหน้าเมนูประวัติคำร้องเรียน

  Scenario: TC002-ค้นหาคำร้องเรียนด้วยสถานะคำร้อง (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประวัติคำร้องเรียน
    And เลือกประเภทคำร้องเรียน "ดำเนินการ"
    And คลิกปุ่มค้นหา
    Then ระบบแสดงหน้าเมนูประวัติคำร้องเรียน

  Scenario: TC003-แสดงรายละเอียดคำร้องเรียน (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประวัติคำร้องเรียน
    And เลือกคำร้องเรียนที่ต้องการดู
    Then ระบบแสดงหน้าจอติดตามคำร้องเรียน

  Scenario: TC004-ค้นหาคำร้องเรียนจากวันที่ยื่น (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประวัติคำร้องเรียน
    And เลือกวันที่ "23/03/2025"
    And คลิกปุ่มค้นหา
    Then ระบบแสดงหน้าเมนูประวัติคำร้องเรียน

  Scenario: TC005-ค้นหาคำร้องเรียนที่ไม่มีอยู่ในระบบ (Negative)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประวัติคำร้องเรียน
    And กรอกหมายเลขคำร้องเรียน "999999"
    And คลิกปุ่มค้นหา
    Then ระบบแสดงหน้าเมนูประวัติคำร้องเรียน

  Scenario: TC007-ค้นหาคำร้องเรียนโดยไม่กรอกข้อมูล  (Negative)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประวัติคำร้องเรียน
    And กรอกหมายเลขคำร้องเรียน " "
    And คลิกปุ่มค้นหา
    Then ระบบแสดงหน้าเมนูประวัติคำร้องเรียน

  Scenario: TC008-ค้นหาคำร้องเรียนจากช่วงวันที่ไม่ถูกต้อง  (Negative)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประวัติคำร้องเรียน
    And เลือกวันที่ "23/03/2029"
    And คลิกปุ่มค้นหา
    Then ระบบแสดงหน้าเมนูประวัติคำร้องเรียน

  Scenario: TC010-การติดตามคำร้องเรียนที่มีเอกสารแนบ
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประวัติคำร้องเรียน
    And กรอกหมายเลขคำร้องเรียน "TTT68030078"
    And คลิกปุ่มค้นหา
    And เลือกคำร้องเรียนที่ต้องการดู
    Then ดาวน์โหลดไฟล์
