Feature: File Complaint
    Feature Login page will work depending on the user credentials.

  Background:
    Given เปิดเว็บไซต์ PMRP

  @smoke @sanity
  Scenario: TC001-ระบบแสดงรายการประเภทคำร้องเรียนทั้งหมด (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    Then ระบบแสดงหน้าเมนูประเภทคำร้องเรียน

  Scenario: TC003-ระบบสามารถค้นหาประเภทคำร้องเรียน (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And กรอกประเภทคำร้องเรียน "คำร้องเรียนเกี่ยวกับการให้บริการหรือผลิตภัณฑ์"
    And คลิกปุ่มค้นหา
    Then ระบบแสดงหน้าเมนูประเภทคำร้องเรียน

  Scenario: TC004-ระบบสามารถกรองประเภทคำร้องเรียนตามสถานะ (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And เลือกสถานะ "เปิด"
    And คลิกปุ่มค้นหา
    Then ระบบแสดงหน้าเมนูประเภทคำร้องเรียน

  Scenario: TC005-ระบบรองรับการแบ่งหน้า (Pagination) (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And คลิกปุ่มถัดไป
    Then ระบบแสดงหน้าเมนูประเภทคำร้องเรียน
