Feature: File Complaint
    Feature Login page will work depending on the user credentials.

  Background:
    Given เปิดเว็บไซต์ PMRP

  @smoke @sanity
  # Scenario: TC001-การเข้าถึงหน้าแก้ไขประเภทคำร้องเรียน (Positive)
  #   When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
  #   And คลิกปุ่มเข้าสู่ระบบ
  #   And คลิกเมนูประเภทคำร้องเรียน
  #   And คลิกปุ่มแก้ไขประเภทคำร้องเรียน
  #   Then ระบบแสดงหน้าเมนูแก้ไขประเภทคำร้องเรียน

  # Scenario: TC002-การแก้ไขประเภทคำร้องเรียนสำเร็จ (Positive)
  #   When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
  #   And คลิกปุ่มเข้าสู่ระบบ
  #   And คลิกเมนูประเภทคำร้องเรียน
  #   And คลิกปุ่มแก้ไขประเภทคำร้องเรียน
  #   And กรอกชื่อประเภทคำร้อง "ปัญหาการให้บริการลูกค้า"
  #   And กรอกรายละเอียดประเภทคำร้อง "ปัญหาที่เกี่ยวข้องกับการให้บริการ"
  #   And เปิดใช้งานการมองเห็น
  #   Then คลิกปุ่มบันทึก

  # Scenario: TC003-ระบบบันทึกการเปลี่ยนแปลงและแสดงข้อมูลที่แก้ไขแล้ว (Positive)
  #   When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
  #   And คลิกปุ่มเข้าสู่ระบบ
  #   And คลิกเมนูประเภทคำร้องเรียน
  #   And คลิกปุ่มแก้ไขประเภทคำร้องเรียน
  #   And กรอกชื่อประเภทคำร้อง "ปัญหาการให้บริการลูกค้า"
  #   Then คลิกปุ่มยกเลิก

  # Scenario: TC004-การแก้ไขประเภทคำร้องเรียนที่มีตัวเลขในชื่อ  (Positive)
  #   When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
  #   And คลิกปุ่มเข้าสู่ระบบ
  #   And คลิกเมนูประเภทคำร้องเรียน
  #   And คลิกปุ่มแก้ไขประเภทคำร้องเรียน
  #   And กรอกชื่อประเภทคำร้อง "ปัญหาด้านบริการ 24 ชั่วโมง"
  #   Then คลิกปุ่มบันทึก

  # Scenario: TC005-การแก้ไขประเภทคำร้องเรียนเป็นชื่อภาษาอังกฤษ  (Positive)
  #   When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
  #   And คลิกปุ่มเข้าสู่ระบบ
  #   And คลิกเมนูประเภทคำร้องเรียน
  #   And คลิกปุ่มแก้ไขประเภทคำร้องเรียน
  #   And กรอกชื่อประเภทคำร้อง "Technical Complaint"
  #   Then คลิกปุ่มบันทึก

  Scenario: TC008-การแก้ไขประเภทคำร้องเรียนเป็นชื่อที่ซ้ำกัน (Negative)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูประเภทคำร้องเรียน
    And คลิกปุ่มแก้ไขประเภทคำร้องเรียน
    And กรอกชื่อประเภทคำร้อง "ร้องเรียนด้านเทคนิค"
    Then คลิกปุ่มบันทึก