Feature: File Complaint
    Feature Login page will work depending on the user credentials.

  Background:
    Given เปิดเว็บไซต์ PMRP

  @smoke @sanity
  Scenario: TC001-ทดสอบการเข้าสู่เมนู "ยื่นคำร้องเรียน" (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูยื่นคำร้องเรียน
    And ยืนยันข้อตกลงหลักเกณฑ์รับคำร้องเรียน
    Then ระบบแสดงหน้าเมนูยื่นคำร้องเรียน

  Scenario: TC002-ทดสอบฟอร์มแสดงผลครบถ้วน
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูยื่นคำร้องเรียน
    And ยืนยันข้อตกลงหลักเกณฑ์รับคำร้องเรียน
    Then ระบบแสดงหน้าเมนูยื่นคำร้องเรียน

  Scenario: TC003-ยื่นคำร้องเรียนสำเร็จ (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูยื่นคำร้องเรียน
    And ยืนยันข้อตกลงหลักเกณฑ์รับคำร้องเรียน
    And ประเภทคำร้องเรียน: "คำร้องเรียนเกี่ยวกับพนักงาน"
    And หัวข้อเรื่องคำร้องเรียน: "พนักงานบริการไม่สุภาพ"
    And รายละเอียดคำร้องเรียน: "พนักงานไม่รับฟังปัญหา"
    And สิ่งที่ต้องการให้แก้ไข: "การบริการ"
    Then ระบบบันทึกคำร้องเรียนและแสดงหมายเลขคำร้อง

  Scenario: TC004-ทดสอบการยื่นคำร้องเรียนพร้อมแนบไฟล์
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูยื่นคำร้องเรียน
    And ยืนยันข้อตกลงหลักเกณฑ์รับคำร้องเรียน
    And ประเภทคำร้องเรียน: "คำร้องเรียนเกี่ยวกับพนักงาน"
    And หัวข้อเรื่องคำร้องเรียน: "พนักงานบริการไม่สุภาพ"
    And รายละเอียดคำร้องเรียน: "พนักงานไม่รับฟังปัญหา"
    And สิ่งที่ต้องการให้แก้ไข: "การบริการ"
    And แนบไฟล์ภาพหลักฐาน "hike.png"
    Then ระบบบันทึกคำร้องเรียนและแสดงหมายเลขคำร้อง

  Scenario: TC005-กดยกเลิกก่อนยื่นคำร้อง (Positive)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูยื่นคำร้องเรียน
    And ยืนยันข้อตกลงหลักเกณฑ์รับคำร้องเรียน
    And ประเภทคำร้องเรียน: "คำร้องเรียนเกี่ยวกับพนักงาน"
    And หัวข้อเรื่องคำร้องเรียน: "พนักงานบริการไม่สุภาพ"
    And รายละเอียดคำร้องเรียน: "พนักงานไม่รับฟังปัญหา"
    And สิ่งที่ต้องการให้แก้ไข: "การบริการ"
    Then กดปุ่มยกเลิก

  Scenario: TC009-อัปโหลดไฟล์แนบที่มีขนาดเกินกำหนด (Negative)
    When กรอกไอดี "hr_org" และรหัสผ่าน "123456"
    And คลิกปุ่มเข้าสู่ระบบ
    And คลิกเมนูยื่นคำร้องเรียน
    And ยืนยันข้อตกลงหลักเกณฑ์รับคำร้องเรียน
    And ประเภทคำร้องเรียน: "คำร้องเรียนเกี่ยวกับพนักงาน"
    And หัวข้อเรื่องคำร้องเรียน: "พนักงานบริการไม่สุภาพ"
    And รายละเอียดคำร้องเรียน: "พนักงานไม่รับฟังปัญหา"
    And สิ่งที่ต้องการให้แก้ไข: "การบริการ"
    And แนบไฟล์ภาพหลักฐาน "Notion Setup 4.7.0.exe"
    Then ระบบบันทึกคำร้องเรียนและแสดงหมายเลขคำร้อง
